_posts/2015-03-19-Restarting-org-babel-sessions-in-org-mode-more-effectively.html
---
title: Restarting org-babel sessions in org-mode more effectively
date: 2015/03/19 18:53:18
updated: 2015/03/19 18:53:18
categories: orgmode
tags: 
---



<p>
In a previous <a href="http://kitchingroup.cheme.cmu.edu/blog/2015/03/12/Making-org-mode-Python-sessions-look-better/">post</a> I eliminated one annoying problem with sessions, which was getting rid of extraneous Python interpreter characters in the output. Another thing that has bothered me is when you close Emacs, or even the session buffer, the session is, of course, lost. That means when you reopen the file, you have to run each block in order to continue your work. There does not seem to be a selective way to do this in org. So, in this post, we consider a simple approach to automate that. We want a function that will run all the blocks in a current session that are above the current point.
</p>


<p>
The idea is we will go to the beginning of the buffer, find all blocks that match the language of the block we are in, and in the session, and execute them. We can tell if a block is in a session by looking at the :parameters property of the block. Interestingly, if a block is not in a session, then session will be "none", if it is in an unnamed session, session will be nil, and otherwise, session will be the session name.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">scenario</th>
<th scope="col" class="left">:session value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">no session</td>
<td class="left">"none"</td>
</tr>

<tr>
<td class="left">unnamed session</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="left">named session</td>
<td class="left">"name"</td>
</tr>
</tbody>
</table>

<p>
Here is a function for testing if a block is in a session.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">src-block-in-session-p</span> (<span style="color: #6434A3;">&amp;optional</span> name)
  <span style="color: #036A07;">"Return if src-block is in a session of NAME.</span>
<span style="color: #036A07;">NAME may be nil for unnamed sessions."</span>
  (<span style="color: #0000FF;">let*</span> ((info (org-babel-get-src-block-info))
         (lang (nth 0 info))
         (body (nth 1 info))
         (params (nth 2 info))
         (session (cdr (assoc <span style="color: #006FE0;">:session</span> params))))

    (<span style="color: #0000FF;">cond</span>
     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">unnamed session, both name and session are nil</span>
     ((and (null session)
           (null name))
      t)
     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Matching name and session</span>
     ((and
       (stringp name)
       (stringp session)
       (string= name session))
      t)
     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">no match</span>
     (t nil))))
</pre>
</div>

<p>
Now, we need to get some information about the current point and block. We will want to run blocks that start before the current point, but not after. We will use org-element-map to find code blocks, and when the language and session of a code block matches the current block, and the block starts at a point earlier than the current point, then we will go to that block, and run it. Here is that code.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-babel-restart-session-to-point</span> (<span style="color: #6434A3;">&amp;optional</span> arg)
  <span style="color: #036A07;">"Restart session up to the src-block in the current point.</span>
<span style="color: #036A07;">Goes to beginning of buffer and executes each code block with</span>
<span style="color: #036A07;">`</span><span style="color: #D0372D;">org-babel-execute-src-block</span><span style="color: #036A07;">' that has the same language and</span>
<span style="color: #036A07;">session as the current block. ARG has same meaning as in</span>
<span style="color: #036A07;">`</span><span style="color: #D0372D;">org-babel-execute-src-block</span><span style="color: #036A07;">'."</span>
  (interactive <span style="color: #008000;">"P"</span>)
  (<span style="color: #0000FF;">unless</span> (org-in-src-block-p)
    (<span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #008000;">"You must be in a src-block to run this command"</span>))
  (<span style="color: #0000FF;">let*</span> ((current-point (point-marker))
         (info (org-babel-get-src-block-info))
         (lang (nth 0 info))
         (params (nth 2 info))
         (session (cdr (assoc <span style="color: #006FE0;">:session</span> params))))
    (<span style="color: #0000FF;">save-excursion</span>
      (goto-char (point-min))
      (<span style="color: #0000FF;">while</span> (re-search-forward org-babel-src-block-regexp nil t)
        <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">goto start of block</span>
        (goto-char (match-beginning 0))
        (<span style="color: #0000FF;">let*</span> ((this-info (org-babel-get-src-block-info))
               (this-lang (nth 0 this-info))
               (this-params (nth 2 this-info))
               (this-session (cdr (assoc <span style="color: #006FE0;">:session</span> this-params))))
            (<span style="color: #0000FF;">when</span>
                (and
                 (&lt; (point) (marker-position current-point))
                 (string= lang this-lang)
                 (src-block-in-session-p session))
              (org-babel-execute-src-block arg)))
        <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">move forward so we can find the next block</span>
        (forward-line)))))
</pre>
</div>


<p>
In the course of testing this, I found this function a little helpful to kill the current session so we start fresh.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-babel-kill-session</span> ()
  <span style="color: #036A07;">"Kill session for current code block."</span>
  (interactive)
  (<span style="color: #0000FF;">unless</span> (org-in-src-block-p)
    (<span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #008000;">"You must be in a src-block to run this command"</span>))
  (<span style="color: #0000FF;">save-window-excursion</span>
    (org-babel-switch-to-session)
    (kill-buffer)))
</pre>
</div>

<p>
And also this one to remove all results in the buffer. This not at all selective, it removes results for session and non-session blocks.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-babel-remove-result-buffer</span> ()
  <span style="color: #036A07;">"Remove results from every code block in buffer."</span>
  (interactive)
  (<span style="color: #0000FF;">save-excursion</span>
    (goto-char (point-min))
    (<span style="color: #0000FF;">while</span> (re-search-forward org-babel-src-block-regexp nil t)
      (org-babel-remove-result))))
</pre>
</div>

<p>
Ok, now for some testing. The rest of this post is pretty boring, just some blocks of mixed session and non-session to see if they get run. Skip to the <a href="#sec-1">1</a>.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f</span>(x):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">y</span> = 4 * x
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> y

<span style="color: #0000FF;">print</span>(f(d))
</pre>
</div>

<pre class="example">
16
</pre>

<p>
Let us put a non-session block in this buffer for testing.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #BA36A5;">a</span> = 5
<span style="color: #0000FF;">print</span>(a)
</pre>
</div>

<p>
Now, some more named session blocks.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">print</span> f(5)
</pre>
</div>

<pre class="example">
20
</pre>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">print</span> <span style="color: #008000;">'ok'</span>
</pre>
</div>

<pre class="example">
ok
</pre>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">print</span> 2
</pre>
</div>

<pre class="example">
2
</pre>

<p>
An unnamed session that should not get run in restarting the named test session.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">print</span> 886
</pre>
</div>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">print</span> f(6)
</pre>
</div>

<pre class="example">
24
</pre>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
This works pretty well so far.  It would be nice to consider making C-c C-c do this automatically, if the session does not exist, and maybe to take a prefix arg that would restart the session. Maybe on another day ;)
</p>
</div>
</div>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/03/19/Restarting-org-babel-sessions-in-org-mode-more-effectively.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>